app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-04-08 20:31:26.924723"], ["updated_at", "2018-04-08 20:31:26.924723"]]
---
  def create

    Post.create(title: params[:post_title], description: params[:post_description])